#### 💳 Payments Terraform Plan

**Status:** `success`

<details><summary>📋 Show Plan</summary>

```terraform
data.terraform_remote_state.dynamodb: Reading...
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 0s
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=tech-challenge-cluster]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # kubernetes_service.app will be created
  + resource "kubernetes_service" "app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "payments-service"
          + namespace        = "tech-challenge"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "payments"
            }
          + session_affinity                  = "None"
          + type                              = "ClusterIP"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }

          + session_affinity_config (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + service_name = "payments-service"

Error: Unable to find remote state

  with data.terraform_remote_state.dynamodb,
  on main.tf line 40, in data "terraform_remote_state" "dynamodb":
  40: data "terraform_remote_state" "dynamodb" {

No stored state was found for the given workspace in the given backend.
::error::Terraform exited with code 1.

```

</details>

---
*Triggered by: @TheMyFish via `pull_request`*